// DO NOT EDIT. This is code generated via package:intl/generate_localized.dart
// This is a library that provides messages for a ar locale. All the
// messages from the main program should be duplicated here with the same
// function name.

// Ignore issues from commonly used lints in this file.
// ignore_for_file:unnecessary_brace_in_string_interps, unnecessary_new
// ignore_for_file:prefer_single_quotes,comment_references, directives_ordering
// ignore_for_file:annotate_overrides,prefer_generic_function_type_aliases
// ignore_for_file:unused_import, file_names, avoid_escaping_inner_quotes
// ignore_for_file:unnecessary_string_interpolations, unnecessary_string_escapes

import 'package:intl/intl.dart';
import 'package:intl/message_lookup_by_library.dart';

final messages = new MessageLookup();

typedef String MessageIfAbsent(String messageStr, List<dynamic> args);

class MessageLookup extends MessageLookupByLibrary {
  String get localeName => 'ar';

  final messages = _notInlinedMessages(_notInlinedMessages);
  static Map<String, Function> _notInlinedMessages(_) => <String, Function>{
        "ArarHouse": MessageLookupByLibrary.simpleMessage(
            "بيت عرار من أبرز الأماكن الثقافية في إربد.\nتم تأسيسه لإستضافة الأحداث الثقافية و المعرفية في المدينة، وما زال محافظاً على طابعه و تصميمه التراثي.\nيمتاز بسهولة الوصول إليه كباقي المناطق الثقافية و السياحية في إربد."),
        "aboutIrbidCity":
            MessageLookupByLibrary.simpleMessage(" نبذة عن مدينة إربد"),
        "cultureIrbid": MessageLookupByLibrary.simpleMessage(
            "جاءت تسمية مدينة إربد من الحضارة الأشورية بدايةً، والتي تصدرت لقب عاصمة الثقافة العربية لعام 2022. \nوتعددت المراكز الثقافية في محافظة إربد والتي بلغ عددها 124 هيئة ثقافية توزعت على مختلف أنحاء ألويتها، لإثبات كفاءة العناية بالمناطق التي تُمثل رموز الرايات الحضارية المُتعاقبة في إربد، وللحفاظ على الموروث الثقافي عبر الأجيال.\n وتنفذ انشطةٍ سنويةٍ متنوعةٍ من مهرجانات ومؤتمرات وأمسيات شعرية وندوات ثقافية ومعارض فنية منوعة على مُدرجاتها الأثرية مثل مدرج مدينة أم قيس أو في المحافل الثقافية أو البيوت الشعرية والمناطق الي تجمع أهل الثقافة لإقامة الأنشطة المُهتمة بتعرفة السكان على الموروث الثقافي في محافظة إربد.\n ومن أبرز الأماكن الثقافية في إربد \" بيت عرار \" والذي تم تأسيسه لإستضافة الأحداث الثقافية والمعرفية في المدينة، ويقع المتحف في منزل الشاعر مصطفى وهبي التل، الملقّب بشاعر الأردن وعرار، وما زال مُحافظاً على طابعه وتصميمه القديم. ويمتاز بسهولة الوصول اليه كباقي المناطق الثقافية والسياحية الحضارية أو الأثرية في محافظة إربد.\n ومن أبرز المهرجانات الثقافية التي قامت في إربد، هو مهرجان الثقافة العربي الذي أُقيم في جامعة اليرموك المُسماة تيمُمناً بنهر اليرموك؛ حيث استضاف المهرجان كافة اعلام الدول العربية بما تحتويه من رموزها الثقافية للحفاظ على هذا الموروث والإعتزاز به وبالوطن الأسمى."),
        "dance": MessageLookupByLibrary.simpleMessage(" عروس الشمال"),
        "darSaraya": MessageLookupByLibrary.simpleMessage(
            "متحف دار السرايا في قلب إربد.\nيحتوي على مجموعة من الآثار الرومانية و اليونانية و الإسلامية التي تعاقبت على محافظة إربد.\nيمكنالوصول له من مختلف المناطق لتوسطه المحافظة."),
        "economyIrbid": MessageLookupByLibrary.simpleMessage(
            "شهدت إربد تعاقب الحضارات المختلفة ومن أبرزها الإمبراطورية اليونانية والرومانية، والتي تركت من بعدها أُسس الأنشطة الرئيسية التي سادت حضاراتهم، الا وهي الزراعة، فكانت النشاط الإقتصادي السائد الذي تعتمد عليه أراضي محافظة إربد، والتي تتمتع بقطاع زراعي مزدهر يجعلها المنتج الرئيسي لتشكيلة واسعة من المنتجات الزراعية على مستوى المملكة، حيث تشكل الأراضي القابلة للزراعة ما نسبته (٧٦%) من مساحة المحافظة في قطاع الزراعة، و (٢٠%) من مساحة كامل الأراضي القابلة للزراعة في المملكة، فيُسمى غورها ب\"سلة الغذاء الاردني\" ، وكذلك لإحتواءها على الثروة الحيوانية التي تُعد مصدر المنتجات العضوية لسكانها.\nاربد هي محافظة رائدة زراعياً و سياحياً قادرة على خلق قيمة مضافة لتوفير فرص العمل لأبنائها وتحسين مستوى معيشتهم، و وجود ٣ مدن صناعية (مدينة الحسن الصناعية ، سايبر سيتي ، وجسر الملك حسين)، وتوفر البنية التحتية اللازمة للإستثمار ساهم بشكل كبير في جذب الاستثمارات الاجنبية وخلق فرص العمل وتعزيز الصادرات وزيادة حجم الانشطة الاقتصادية الداعمة، وتوفر المراكز التدريبية الخاصة وستة مراكز مهنية حيث اسهمت في توفير الايدي العاملة والمؤهلة في مختلف المجالات، مما عزز حركة النشاط الاقتصادي في المحافظة وفي مختلف القطاعات. بالإضافة للموقع الجغرافي الذي يجعلها حلقة وصل ما بين سوريا وفلسطين مما يسهل حركة التنقلات البريه للبضائع والمسافرين للدول المجاورة. و وجود عدد من الطلاب الإجانب من جنسيات مختلفة حافز للمستثمريــن في مجال الفندقة والمدن السياحية والترفيهية والأبراج السكنية والمراكز التجارية و المطاعم."),
        "educationIrbid": MessageLookupByLibrary.simpleMessage(
            "يتميز القطاع التعليمي في محافظة إربد بالتنوع من حيث الفئات التدريسية والأعمار والأعداد الوفيرة من الطُلاب المقبلين على الدراسة بمختلف مجالاتها في الجامعات. حيث يوجد فيها خمس جامعات منها ثلاثة حكومية واثنتان خاصة وكذلك عدد من كليات المجتمع.\nوصل عدد المدارس فيها بمختلف أعمار طُلابها وأجناسهم الى 576  مدرسة حكومية ذات تعليم مجاني لطلبتها، لتحتوي على رُبع مليون طالب صفي يُمثلون إزدهار الأردن وتنمية أواصر تعليمها البنّاء بما في ذلك التربية والتنشئة السليمة.\nوبذلك يُشكل القطاع التعليمي القطاع الحركي الأسمى على مستوى المحافظة لكثرة المُقبلين عليه من خلال تنشيطهم للإقتصاد المحلي والتعليمي وحركة المواصلات الدائمة التي تخدم هؤلاء الطلاب بإيصالهم الى مهاجعهم التعليمية.\nومن ميزاته وجود المجلس الأعلى للمعاقين الذي يهتم بالطلاب ذوي الإحتياجات الخاصة لضمان حصولهم على حقوقهم التعليمية جنباً الى جنب مع باقي الطلبة."),
        "healthIrbid": MessageLookupByLibrary.simpleMessage(
            "امتازت محافظة اربد بتوفر الرعاية الصحية الشاملة لمواطنيها على مختلف أجناسهم كأردنيين أم لاجئين.\nاحتوت على العديد من المستشفيات التي توزعت على كامل أنحاءها سواءً في مدينتها أو في قراها لتكون مخدومةً على الصعيد الصحي. \nيوجد فيها 10 مستشفيات رئيسية تُقدم كافة مجالات الاختصاص الطبي والخدمات الصحية والعلاجية، مع توفر 10 مراكز صحية أخرى لخدمة الأحياء التابعة لها. ومن مهام هذه المراكز والمستشفيات تقديم الخدمات الصحية الوقائية والعلاجية للسكان في محافظة اربد. وتحسين جودة وسلامة خدمات الرعاية الصحية وضمان استمراريتها، وتعزيز خدمات الصحة الانجابية وتنظيم الاسرة وصحة الطفل. والجهود الوقائية لمكافحة الامراض غير السارية، ورصد السارية منها. واصدار بطاقات التامين الصحي لمستحقيه بكافة فئاته."),
        "historical": MessageLookupByLibrary.simpleMessage("تاريخية"),
        "historicalTourism": MessageLookupByLibrary.simpleMessage(
            "تعود أصول مدينة إربد الى العصر البرونزي لعام 1222 ق.م، فقد عاصرت ُمختلف الحضارات اآلرمية والعمونية والرومانية اليونانية، لتكون بذلك من ال ُمستطونات القديمة جنوب بالد الشام. حيث خلَفت هذه الحضارات مختلف المناطق السياحية واألثرية فيها."),
        "historyIrbid": MessageLookupByLibrary.simpleMessage(
            "تُمثل إربد في ثنايها موروثاً حضارياً تعاقبت عليها الإمبراطوريات والأُمم السابقة، والتي خلّفت ورائها آثارها ومُقتنياتها وكنوزها التي ما زالت شامِخةً على أراضيها.\n ويوجد فيها مقامات الصحابةِ رضوان الله عليهم، والتي فتحت مجالاً للسياحة الدينية في زيارةٍ الى أضرحة هؤلاء الصحابة. منهم مقام سيدنا معاذ بن جبل في الشونة الشمالية، فهو من ابرز مقامات صحابة رسول الله في المنطقة . ويضم المقام مسجدا للرجال واخر للنساء ومكتبة والمركز الثقافي الاسلامي للرجال وحديقة ومواقف سيارات ومدرسة نموذجية للقران الكريم استحدثتها وزارة الاوقاف والمرافق الاخرى لزيادة الخدمات الدينية.\n وهناك الصحابي شرحبيل بن حسنة ومقامه في وادي الريان، وقد تميز الصحابي بالشجاعة والتضحية والكرم والذكاء وحسن الادارة ما دفع بالخليفة عمر بن الخطاب رضي الله عنه الى توليته على ربع الشام، وشارك صاحب المقام رضي الله مع الرسول العظيم صلى الله عليه وسلم الهجرتين وفي معارك الشام. ثم توفي في طاعون عمواس في السنة الثامنة للهجرة. مقامُه يضم مصلى للرجال ومكتبة وحديقة ومواقف للسيارات وقبة ومأذنة.\n وهناك موقع معركة اليرموك بالقرب من نهر اليرموك والتي كانت سنة (15 هـ - 636م) بين المسلمين والإمبراطورية البيزنطية، يعتبرها بعض المؤرخين من أهم المعارك في تاريخ العالم لأنها كانت بداية أول موجة انتصارات للمسلمين خارج جزيرة العرب، وأدت لتقدم الإسلام السريع في بلاد الشام. المعركة حدثت بعد وفاة الرسول صلى الله عليه وسلم عام 632م بأربع سنوات."),
        "homePage": MessageLookupByLibrary.simpleMessage("الصحفة الرئيسية"),
        "introIrbid": MessageLookupByLibrary.simpleMessage(
            "أهلاً بكم في محافظة إربد عروس الشمال، حللتم سهلاً على أهلها الكِرام، أرض الفتوحات الإسلامية ومجمع الحضارات التاريخية، الآرامية والعمونية والرومانية واليونانية، فكانت تُسمى أرضُ فتحِ الشام.\n وأبرز معالمها نهر اليرموك المُسمّى تيمُناً بمعركة اليرموك الأبرز على أرض محافظة إربد. وقد سادت المسيحية كديانةٍ لسكانها وصولاً الى الإسلامية في وقتنا الحاضر. \nوتتكون من تقسيماتٍ إداريةٍ لكُلٍ منها قُراها ذات الـ 133 قرية.\nوبتعدادِ سُكان ما يقارب 2 مليون نسمة مُتركزين في مُنتصفها بالمناطق السهلية المُنبسطة، بمُختلف ثقافاتهم الشعبية والمُمتزجة من شتى أنحاءها.\n وتعتبر المحافظة من أجمل المناخات في العالم حيث الوادي الأخضـر والذي يشكل مشتى متكامل وجبال دائمة الخُضرة على مدار العام، وسهول خصبة وتوفر الميـاه الجوفية، أي أنها ذات مُناخات المتنوعة، ما شكل حافزاً كبيراً للاستثمار بها في مجال السياحة."),
        "irbidCul": MessageLookupByLibrary.simpleMessage("الثقافة في إربد"),
        "irbidEco": MessageLookupByLibrary.simpleMessage("الإقتصاد في إربد"),
        "irbidEdu": MessageLookupByLibrary.simpleMessage("التعليم في إربد"),
        "irbidGovernorateCulture":
            MessageLookupByLibrary.simpleMessage(" الثقافة في مدينة إربد"),
        "irbidGovernorateEco":
            MessageLookupByLibrary.simpleMessage(" الإقتصاد في مدينة إربد"),
        "irbidGovernorateHistory":
            MessageLookupByLibrary.simpleMessage(" تاريخ مدينة إربد"),
        "irbidHeal":
            MessageLookupByLibrary.simpleMessage("القطاع الصحي في إربد"),
        "irbidHis": MessageLookupByLibrary.simpleMessage("تاريخ إربد"),
        "irbidTou": MessageLookupByLibrary.simpleMessage("السياحة في إربد"),
        "muathShrine": MessageLookupByLibrary.simpleMessage(
            "مقام معاذ بن جبل في الشونة الشمالية، من ابرز مقامات الصحابة.\nيضم المقام مسجداً للرجال و أخر للنساء و مكتبة و المركز الثقافي الاسلامي للرجال و مواقف سيارات، و بعضاً من المرافق الأخرى لزيادة الخدمات الدينية."),
        "nature": MessageLookupByLibrary.simpleMessage("طبيعية"),
        "therapeutic": MessageLookupByLibrary.simpleMessage("علاجية"),
        "title": MessageLookupByLibrary.simpleMessage("إربد"),
        "tourismIrbid": MessageLookupByLibrary.simpleMessage(
            "تعود أصول مدينة إربد الى العصر البرونزي لعام 3000 ق.م، فقد عاصرت مُختلف الحضارات الآرمية والعمونية والرومانية اليونانية، لتكون بذلك من المُستطونات القديمة جنوب بلاد الشام. حيث خلَفَت هذه الحضارات مختلف المناطق السياحية والأثرية فيها.")
      };
}
