// DO NOT EDIT. This is code generated via package:intl/generate_localized.dart
// This is a library that provides messages for a ar locale. All the
// messages from the main program should be duplicated here with the same
// function name.

// Ignore issues from commonly used lints in this file.
// ignore_for_file:unnecessary_brace_in_string_interps, unnecessary_new
// ignore_for_file:prefer_single_quotes,comment_references, directives_ordering
// ignore_for_file:annotate_overrides,prefer_generic_function_type_aliases
// ignore_for_file:unused_import, file_names, avoid_escaping_inner_quotes
// ignore_for_file:unnecessary_string_interpolations, unnecessary_string_escapes

import 'package:intl/intl.dart';
import 'package:intl/message_lookup_by_library.dart';

final messages = new MessageLookup();

typedef String MessageIfAbsent(String messageStr, List<dynamic> args);

class MessageLookup extends MessageLookupByLibrary {
  String get localeName => 'ar';

  final messages = _notInlinedMessages(_notInlinedMessages);
  static Map<String, Function> _notInlinedMessages(_) => <String, Function>{
        "abdullah1":
            MessageLookupByLibrary.simpleMessage("مسشتفى الملك عبدالله الثاني"),
        "abdullah1Talk": MessageLookupByLibrary.simpleMessage(
            "هو أكبر مستشفيات محافظة اربد وأكثرها إقبالاً من قبل المرضى بسبب ميزته في تقديم الخدمات الصحية ذات الجودة العالية وموقعه المتوسط والواقع على مسارب الطرق الرئيسية المفتوحة، وهو من ضمن جامعة العلوم والتكنولوجيا.\nيحتوي على كافة التخصصات الطبية المطلوبة، لضمان توفير العلاج المناسب لكافة المرضى بمختلف مُتطلباتهم. بقدرة تشغيلية تبلغ 678 سريرا قابلة للزيادة الى 819 سريرا في حالة الطوارئ."),
        "aboutIrbidCity":
            MessageLookupByLibrary.simpleMessage(" نبذة عن مدينة إربد"),
        "ararHouse": MessageLookupByLibrary.simpleMessage("بيت عرار الثقافي"),
        "ararHouseTalk": MessageLookupByLibrary.simpleMessage(
            "بيت عرار من أبرز الأماكن الثقافية في إربد.\nتم تأسيسه لإستضافة الأحداث الثقافية و المعرفية في المدينة، وما زال محافظاً على طابعه و تصميمه التراثي.\nيمتاز بسهولة الوصول إليه كباقي المناطق الثقافية و السياحية في إربد."),
        "arays": MessageLookupByLibrary.simpleMessage("بركة العرايس"),
        "araysTalk": MessageLookupByLibrary.simpleMessage(
            "تعد هذه البركة من أجمل البرك الموجودة في الأردن إذ تتواجد بين سلسلة جبال تقع في قرية ملكا مكونة منظرا جماليا في الربيع، وتعد من أهم البرك الموجودة في الأردن بل وفي الوطن العربي إذ تحتضن عدد من الحيوانات المهمة، مثل: السلحفاة المائية المهددة بالإنقراض والبط والطيور المهاجرة إلى أوروبا."),
        "aydon": MessageLookupByLibrary.simpleMessage(
            "مستشفى الامير راشد بن الحسن العسكري"),
        "aydonTalk": MessageLookupByLibrary.simpleMessage(
            "مستشفى مخصص لأصحاب الخدمة العسكرية وعائلاتهم، ويشمل المكرُمة الملكية لأفراد القوات المسلحة والتي ساهمت بتلقي العلاج المجاني لمعظم الحالات المُدخلة اليه."),
        "bade3h": MessageLookupByLibrary.simpleMessage("مستشفى الأميرة بديعة"),
        "bade3hTalk": MessageLookupByLibrary.simpleMessage(
            "من المستشفيات المخصصة لأمراض النساء والتوليد والأطفال، ويمتاز بتكلفته المتدنية لخدمة المواطنين."),
        "basmah": MessageLookupByLibrary.simpleMessage("مستشفى الأميرة بسمة"),
        "basmahTalk": MessageLookupByLibrary.simpleMessage(
            "تم افتتاح المستشفى بقدرةٍ تشغيلية لا تتجاوز الخمسين سريراً ليكون مستشفاً رئيسياً لدى محافظات الشمال آنـذاك. ومع الزيادة السكانية في هذه المحافظات وزيادة حجم العمل في المستشفــى تم زيادة عدد الأسرّة فيه ليصبح 120 سريراً مجهزاً.\nمع تطور الطب على المستوى العالمي والمحلي تم مواكبته أيضا من قبل المستشفى."),
        "cultureIrbid": MessageLookupByLibrary.simpleMessage(
            "جاءت تسمية مدينة إربد من الحضارة الأشورية بدايةً، والتي تصدرت لقب عاصمة الثقافة العربية لعام 2022. \nوتعددت المراكز الثقافية في محافظة إربد والتي بلغ عددها 124 هيئة ثقافية توزعت على مختلف أنحاء ألويتها، لإثبات كفاءة العناية بالمناطق التي تُمثل رموز الرايات الحضارية المُتعاقبة في إربد، وللحفاظ على الموروث الثقافي عبر الأجيال.\n وتنفذ انشطةٍ سنويةٍ متنوعةٍ من مهرجانات ومؤتمرات وأمسيات شعرية وندوات ثقافية ومعارض فنية منوعة على مُدرجاتها الأثرية مثل مدرج مدينة أم قيس أو في المحافل الثقافية أو البيوت الشعرية والمناطق الي تجمع أهل الثقافة لإقامة الأنشطة المُهتمة بتعرفة السكان على الموروث الثقافي في محافظة إربد.\n ومن أبرز الأماكن الثقافية في إربد \" بيت عرار \" والذي تم تأسيسه لإستضافة الأحداث الثقافية والمعرفية في المدينة، ويقع المتحف في منزل الشاعر مصطفى وهبي التل، الملقّب بشاعر الأردن وعرار، وما زال مُحافظاً على طابعه وتصميمه القديم. ويمتاز بسهولة الوصول اليه كباقي المناطق الثقافية والسياحية الحضارية أو الأثرية في محافظة إربد.\n ومن أبرز المهرجانات الثقافية التي قامت في إربد، هو مهرجان الثقافة العربي الذي أُقيم في جامعة اليرموك المُسماة تيمُمناً بنهر اليرموك؛ حيث استضاف المهرجان كافة اعلام الدول العربية بما تحتويه من رموزها الثقافية للحفاظ على هذا الموروث والإعتزاز به وبالوطن الأسمى."),
        "dance": MessageLookupByLibrary.simpleMessage(" عروس الشمال"),
        "darSaraya": MessageLookupByLibrary.simpleMessage(
            "متحف دار السرايا في قلب إربد.\nيحتوي على مجموعة من الآثار الرومانية و اليونانية و الإسلامية التي تعاقبت على محافظة إربد.\nيمكنالوصول له من مختلف المناطق لتوسطه المحافظة."),
        "economyIrbid": MessageLookupByLibrary.simpleMessage(
            "شهدت إربد تعاقب الحضارات المختلفة ومن أبرزها الإمبراطورية اليونانية والرومانية، والتي تركت من بعدها أُسس الأنشطة الرئيسية التي سادت حضاراتهم، الا وهي الزراعة، فكانت النشاط الإقتصادي السائد الذي تعتمد عليه أراضي محافظة إربد، والتي تتمتع بقطاع زراعي مزدهر يجعلها المنتج الرئيسي لتشكيلة واسعة من المنتجات الزراعية على مستوى المملكة، حيث تشكل الأراضي القابلة للزراعة ما نسبته (٧٦%) من مساحة المحافظة في قطاع الزراعة، و (٢٠%) من مساحة كامل الأراضي القابلة للزراعة في المملكة، فيُسمى غورها ب\"سلة الغذاء الاردني\" ، وكذلك لإحتواءها على الثروة الحيوانية التي تُعد مصدر المنتجات العضوية لسكانها.\nاربد هي محافظة رائدة زراعياً و سياحياً قادرة على خلق قيمة مضافة لتوفير فرص العمل لأبنائها وتحسين مستوى معيشتهم، و وجود ٣ مدن صناعية (مدينة الحسن الصناعية ، سايبر سيتي ، وجسر الملك حسين)، وتوفر البنية التحتية اللازمة للإستثمار ساهم بشكل كبير في جذب الاستثمارات الاجنبية وخلق فرص العمل وتعزيز الصادرات وزيادة حجم الانشطة الاقتصادية الداعمة، وتوفر المراكز التدريبية الخاصة وستة مراكز مهنية حيث اسهمت في توفير الايدي العاملة والمؤهلة في مختلف المجالات، مما عزز حركة النشاط الاقتصادي في المحافظة وفي مختلف القطاعات. بالإضافة للموقع الجغرافي الذي يجعلها حلقة وصل ما بين سوريا وفلسطين مما يسهل حركة التنقلات البريه للبضائع والمسافرين للدول المجاورة. و وجود عدد من الطلاب الإجانب من جنسيات مختلفة حافز للمستثمريــن في مجال الفندقة والمدن السياحية والترفيهية والأبراج السكنية والمراكز التجارية و المطاعم."),
        "educationIrbid": MessageLookupByLibrary.simpleMessage(
            "يتميز القطاع التعليمي في محافظة إربد بالتنوع من حيث الفئات التدريسية والأعمار والأعداد الوفيرة من الطُلاب المقبلين على الدراسة بمختلف مجالاتها في الجامعات. حيث يوجد فيها خمس جامعات منها ثلاثة حكومية واثنتان خاصة وكذلك عدد من كليات المجتمع.\nوصل عدد المدارس فيها بمختلف أعمار طُلابها وأجناسهم الى 576  مدرسة حكومية ذات تعليم مجاني لطلبتها، لتحتوي على رُبع مليون طالب صفي يُمثلون إزدهار الأردن وتنمية أواصر تعليمها البنّاء بما في ذلك التربية والتنشئة السليمة.\nوبذلك يُشكل القطاع التعليمي القطاع الحركي الأسمى على مستوى المحافظة لكثرة المُقبلين عليه من خلال تنشيطهم للإقتصاد المحلي والتعليمي وحركة المواصلات الدائمة التي تخدم هؤلاء الطلاب بإيصالهم الى مهاجعهم التعليمية.\nومن ميزاته وجود المجلس الأعلى للمعاقين الذي يهتم بالطلاب ذوي الإحتياجات الخاصة لضمان حصولهم على حقوقهم التعليمية جنباً الى جنب مع باقي الطلبة."),
        "healthIrbid": MessageLookupByLibrary.simpleMessage(
            "امتازت محافظة اربد بتوفر الرعاية الصحية الشاملة لمواطنيها على مختلف أجناسهم كأردنيين أم لاجئين.\nاحتوت على العديد من المستشفيات التي توزعت على كامل أنحاءها سواءً في مدينتها أو في قراها لتكون مخدومةً على الصعيد الصحي. \nيوجد فيها 10 مستشفيات رئيسية تُقدم كافة مجالات الاختصاص الطبي والخدمات الصحية والعلاجية، مع توفر 10 مراكز صحية أخرى لخدمة الأحياء التابعة لها. ومن مهام هذه المراكز والمستشفيات تقديم الخدمات الصحية الوقائية والعلاجية للسكان في محافظة اربد. وتحسين جودة وسلامة خدمات الرعاية الصحية وضمان استمراريتها، وتعزيز خدمات الصحة الانجابية وتنظيم الاسرة وصحة الطفل. والجهود الوقائية لمكافحة الامراض غير السارية، ورصد السارية منها. واصدار بطاقات التامين الصحي لمستحقيه بكافة فئاته."),
        "historical": MessageLookupByLibrary.simpleMessage("تاريخية"),
        "historicalTourism": MessageLookupByLibrary.simpleMessage(
            "تعود أصول مدينة إربد الى العصر البرونزي لعام 1222 ق.م، فقد عاصرت ُمختلف الحضارات اآلرمية والعمونية والرومانية اليونانية، لتكون بذلك من ال ُمستطونات القديمة جنوب بالد الشام. حيث خلَفت هذه الحضارات مختلف المناطق السياحية واألثرية فيها."),
        "historyIrbid": MessageLookupByLibrary.simpleMessage(
            "تُمثل إربد في ثنايها موروثاً حضارياً تعاقبت عليها الإمبراطوريات والأُمم السابقة، والتي خلّفت ورائها آثارها ومُقتنياتها وكنوزها التي ما زالت شامِخةً على أراضيها.\n ويوجد فيها مقامات الصحابةِ رضوان الله عليهم، والتي فتحت مجالاً للسياحة الدينية في زيارةٍ الى أضرحة هؤلاء الصحابة. منهم مقام سيدنا معاذ بن جبل في الشونة الشمالية، فهو من ابرز مقامات صحابة رسول الله في المنطقة . ويضم المقام مسجدا للرجال واخر للنساء ومكتبة والمركز الثقافي الاسلامي للرجال وحديقة ومواقف سيارات ومدرسة نموذجية للقران الكريم استحدثتها وزارة الاوقاف والمرافق الاخرى لزيادة الخدمات الدينية.\n وهناك الصحابي شرحبيل بن حسنة ومقامه في وادي الريان، وقد تميز الصحابي بالشجاعة والتضحية والكرم والذكاء وحسن الادارة ما دفع بالخليفة عمر بن الخطاب رضي الله عنه الى توليته على ربع الشام، وشارك صاحب المقام رضي الله مع الرسول العظيم صلى الله عليه وسلم الهجرتين وفي معارك الشام. ثم توفي في طاعون عمواس في السنة الثامنة للهجرة. مقامُه يضم مصلى للرجال ومكتبة وحديقة ومواقف للسيارات وقبة ومأذنة.\n وهناك موقع معركة اليرموك بالقرب من نهر اليرموك والتي كانت سنة (15 هـ - 636م) بين المسلمين والإمبراطورية البيزنطية، يعتبرها بعض المؤرخين من أهم المعارك في تاريخ العالم لأنها كانت بداية أول موجة انتصارات للمسلمين خارج جزيرة العرب، وأدت لتقدم الإسلام السريع في بلاد الشام. المعركة حدثت بعد وفاة الرسول صلى الله عليه وسلم عام 632م بأربع سنوات."),
        "homePage": MessageLookupByLibrary.simpleMessage("الصحفة الرئيسية"),
        "ibnNafees": MessageLookupByLibrary.simpleMessage("مستشفى ابن النفيس"),
        "ibnNafeesTalk": MessageLookupByLibrary.simpleMessage(
            "مستشفى مختص بحالات الولادة والأمومة ورعاية الطفل، ويدخله شهرياً ما يُقارب ال 2500 مريض."),
        "introIrbid": MessageLookupByLibrary.simpleMessage(
            "أهلاً بكم في محافظة إربد عروس الشمال، حللتم سهلاً على أهلها الكِرام، أرض الفتوحات الإسلامية ومجمع الحضارات التاريخية، الآرامية والعمونية والرومانية واليونانية، فكانت تُسمى أرضُ فتحِ الشام.\n وأبرز معالمها نهر اليرموك المُسمّى تيمُناً بمعركة اليرموك الأبرز على أرض محافظة إربد. وقد سادت المسيحية كديانةٍ لسكانها وصولاً الى الإسلامية في وقتنا الحاضر. \nوتتكون من تقسيماتٍ إداريةٍ لكُلٍ منها قُراها ذات الـ 133 قرية.\nوبتعدادِ سُكان ما يقارب 2 مليون نسمة مُتركزين في مُنتصفها بالمناطق السهلية المُنبسطة، بمُختلف ثقافاتهم الشعبية والمُمتزجة من شتى أنحاءها.\n وتعتبر المحافظة من أجمل المناخات في العالم حيث الوادي الأخضـر والذي يشكل مشتى متكامل وجبال دائمة الخُضرة على مدار العام، وسهول خصبة وتوفر الميـاه الجوفية، أي أنها ذات مُناخات المتنوعة، ما شكل حافزاً كبيراً للاستثمار بها في مجال السياحة."),
        "irbidCul": MessageLookupByLibrary.simpleMessage("الثقافة في إربد"),
        "irbidEco": MessageLookupByLibrary.simpleMessage("الإقتصاد في إربد"),
        "irbidEdu": MessageLookupByLibrary.simpleMessage("التعليم في إربد"),
        "irbidGovernorateCulture":
            MessageLookupByLibrary.simpleMessage(" الثقافة في مدينة إربد"),
        "irbidGovernorateEco":
            MessageLookupByLibrary.simpleMessage(" الإقتصاد في مدينة إربد"),
        "irbidGovernorateHistory":
            MessageLookupByLibrary.simpleMessage(" تاريخ مدينة إربد"),
        "irbidHeal":
            MessageLookupByLibrary.simpleMessage("القطاع الصحي في إربد"),
        "irbidHis": MessageLookupByLibrary.simpleMessage("تاريخ إربد"),
        "irbidNational":
            MessageLookupByLibrary.simpleMessage("جامعة إربد الأهلية"),
        "irbidNationalTalk": MessageLookupByLibrary.simpleMessage(
            "إحدى الجامعات الأردنية الخاصة.\nتوسعت الجامعة من الناحية الأكاديمية والإدارية إلى أن وصلت إلى 6 كليات، وأعداد الأقسام الموجودة فيها الآن 17 قسمًا لمرحلة البكالوريوس، و 3 أقسام لمرحلة الماجستير."),
        "irbidTou": MessageLookupByLibrary.simpleMessage("السياحة في إربد"),
        "islamic": MessageLookupByLibrary.simpleMessage("مستشفى اربد الإسلامي"),
        "islamicTalk": MessageLookupByLibrary.simpleMessage(
            "مستشفى مختص بكافة أنواع صور الأشعة تحليلها من قبل أطباء مختصين، ويعتبر ذا اقبال عالي بسبب دقة الفحص المخبري في أقسامه."),
        "jadara": MessageLookupByLibrary.simpleMessage("جامعة جدارا"),
        "jadaraTalk": MessageLookupByLibrary.simpleMessage(
            "تعطي الجامعة درجة البكالوريوس في 23 تخصص ومساق، ودرجة الماجستير في أربعة مساقات. بالإضافة إلى ذلك، تقدم الجامعة أكثر من 30 دورة متخصصة في علوم الطيران وشبكات الحاسوب والتصميم الجرافيكي وغيرها."),
        "just": MessageLookupByLibrary.simpleMessage(
            "جامعة العلوم و التكنولوجيا الأُردنية"),
        "justTalk": MessageLookupByLibrary.simpleMessage(
            "تتميز الجامعة بتدريس التخصصات العلمية فيها بشكلٍ عام، وتخصصي الطب والهندسة بشكل خاص. وتُعدّ الجامعة في مصاف أفضل أربعمائة جامعة حول العالم، وكذلك تُعدّ من أفضل مئة وخمسين جامعة ناشئة حول العالم.\nتتميز الجامعة أيضا بجسمها الطلابي متنوع الأعراق والجنسيات حيث كان في احد السنوات عدد الطلاب الدوليين 5415 طالب من 61 جنسية مختلفة.\nتبلغ مساحتها 11 كيلو متراً مربعاً."),
        "muath": MessageLookupByLibrary.simpleMessage(
            "مقام الصحابي الجليل معاذ بن جبل"),
        "muathTalk": MessageLookupByLibrary.simpleMessage(
            "مقام معاذ بن جبل في الشونة الشمالية، من ابرز مقامات الصحابة.\nيضم المقام مسجداً للرجال و أخر للنساء و مكتبة و المركز الثقافي الاسلامي للرجال و مواقف سيارات، و بعضاً من المرافق الأخرى لزيادة الخدمات الدينية."),
        "nature": MessageLookupByLibrary.simpleMessage("طبيعية"),
        "pella": MessageLookupByLibrary.simpleMessage("طبقة فحل"),
        "pellaTalk": MessageLookupByLibrary.simpleMessage(
            "تُصنف أنها من الأكشتفات التاريخية العريقة بسبب تصميمها الأثري الذي لفت أذهان ُمحبي الأستكشافات التاريخية."),
        "rahbat":
            MessageLookupByLibrary.simpleMessage("مستشفى الراهبات الورديه"),
        "rahbatTalk": MessageLookupByLibrary.simpleMessage(
            "مع تقدم العلم وزيادة الطلب على المستشفى تقرر بناء جديد للمستشفى الواقع في مدخل مدينة اربد.\n فهو يتسع ل 150 سريرا. ومن اجل الحفاظ على بئية سليمة يعمل المستشفى على الطاقة الشمسية بأحدث معايير السلامة العامة."),
        "rashrash": MessageLookupByLibrary.simpleMessage("شلالات رشراش"),
        "rashrashTalk": MessageLookupByLibrary.simpleMessage(
            "شلال يبلغ ارتفاعه نحو 90 متراً، وهو دائم الجريان على مدار العام.\nيعد الشلال مفقوداً على خريطة الأردن السياحية، بسبب عدم وجود طريق مفتوح إليه، الا ممرات ضيقة."),
        "saraya": MessageLookupByLibrary.simpleMessage("متحف دار السرايا"),
        "sarayaTalk": MessageLookupByLibrary.simpleMessage(
            "متحف \" دار السرايا \" في قلب إربد، والذي يمكن الوصول له من مختلف الانحاء لتوسطه مدينة إربد.\nيحتوي على مجموعة متنوعة من الآثار الرومانية واليونانية والإسلامية التي تعاقبت على محافظة إربد."),
        "shuna": MessageLookupByLibrary.simpleMessage("الحمة الأردنية"),
        "shunaTalk": MessageLookupByLibrary.simpleMessage(
            "إحدى أشهر الوجهات العلاجية في الشرق الأوسط.\nذات الينابيع جوفية حارة يرتادها السكان من شتى أنحاء البلاد للإستفادة من مياهها المعدنية والإسترخاء وعلاج العديد من الأمراض الجلدية."),
        "specialty":
            MessageLookupByLibrary.simpleMessage("مستشفى اربد التخصصي"),
        "specialtyTalk": MessageLookupByLibrary.simpleMessage(
            "من المستشفيات المُختصة بوظائف جسم الإنسان الدقيقة، وهدفهم التميز في تقديم افضل خدمات الرعاية الصحية وفق أحدث المعايير والمواصفات العالمية، و ادخال الأجهزة المختلفة والكوادر المتخصصة لضمان افضل رعاية للمرضى."),
        "therapeutic": MessageLookupByLibrary.simpleMessage("علاجية"),
        "title": MessageLookupByLibrary.simpleMessage("إربد"),
        "tourismIrbid": MessageLookupByLibrary.simpleMessage(
            "تعود أصول مدينة إربد الى العصر البرونزي لعام 3000 ق.م، فقد عاصرت مُختلف الحضارات الآرمية والعمونية والرومانية اليونانية، لتكون بذلك من المُستطونات القديمة جنوب بلاد الشام. حيث خلَفَت هذه الحضارات مختلف المناطق السياحية والأثرية فيها."),
        "umQais": MessageLookupByLibrary.simpleMessage("أٌم قيس"),
        "umQaisTalk": MessageLookupByLibrary.simpleMessage(
            "بنتها الحضارة الرومانية، بمكوناتها العريقة مثل المُدرج الروماني وشارع الأعمدة ومنحوتاتها البارزة الجاذبة."),
        "yarmouk": MessageLookupByLibrary.simpleMessage("جامعة اليرموك"),
        "yarmoukTalk": MessageLookupByLibrary.simpleMessage(
            "أول مؤسسة للتعليم العالي المعروف عنها بالنهج المبتكر في إدارة المؤسسات وتنمية الموارد البشرية والسعي إلى التفوق في البحث والتدريس في مختلف مجالات الفنون والآداب والعلوم الاجتماعية.\nتتكون الجامعة من 15 كلية رئيسية, وفي الجامعة عمادة لشؤون الطلبة وأخرى للبحث العلمي والدراسات العليا.")
      };
}
