// DO NOT EDIT. This is code generated via package:intl/generate_localized.dart
// This is a library that provides messages for a ar locale. All the
// messages from the main program should be duplicated here with the same
// function name.

// Ignore issues from commonly used lints in this file.
// ignore_for_file:unnecessary_brace_in_string_interps, unnecessary_new
// ignore_for_file:prefer_single_quotes,comment_references, directives_ordering
// ignore_for_file:annotate_overrides,prefer_generic_function_type_aliases
// ignore_for_file:unused_import, file_names, avoid_escaping_inner_quotes
// ignore_for_file:unnecessary_string_interpolations, unnecessary_string_escapes

import 'package:intl/intl.dart';
import 'package:intl/message_lookup_by_library.dart';

final messages = new MessageLookup();

typedef String MessageIfAbsent(String messageStr, List<dynamic> args);

class MessageLookup extends MessageLookupByLibrary {
  String get localeName => 'ar';

  final messages = _notInlinedMessages(_notInlinedMessages);
  static Map<String, Function> _notInlinedMessages(_) => <String, Function>{
        "aboutIrbidCity":
            MessageLookupByLibrary.simpleMessage(" نبذة عن مدينة إربد"),
        "dance": MessageLookupByLibrary.simpleMessage("عروس الشمال"),
        "economyIrbid": MessageLookupByLibrary.simpleMessage(
            "شهدت إربد تعاقب الحضارات المختلفة ومن أبرزها اإلمبراطورية اليونانية والرومانية، والتي تركت من بعدها أُسس الأنشطة الرئيسية التي سادت حضاراتهم، الا وهي الزراعة، فكانت النشاط الإقتصادي السائد الذي تعتمد عليه أراضي محافظة إربد، والتي تتمتع بقطاع زراعي مزدهر يجعلها المنتج الرئيسي لتشكيلة واسعة من المنتجات الزراعية على مستوى المملكة، حيث تشكل الأراضي القابلة للزراعة ما نسبته (٧٦%) من مساحة المحافظة في قطاع الزراعة، و (٢٠%) من مساحة كامل الأراضي القابلة للزراعة في المملكة، فيُسمى غورها ب\"سلة الغذاء الاردني\" ، وكذلك لإحتواءها على الثروة الحيوانية التي تُعد مصدر المنتجات العضوية لسكانها. اربد هي محافظة رائدة زراعياً و سياحياً قادرة على خلق قيمة مضافة لتوفير فرص العمل لأبنائها وتحسين مستوى معيشتهم. و وجود ٣ مدن صناعية (مدينة الحسن الصناعية ، سايبر سيتي ، وجسر الملك حسين). وتوفر البنية التحتية اللازمة للإستثمار ساهم بشكل كبير في جذب الاستثمارات الاجنبية وخلق فرص العمل وتعزيز الصادرات وزيادة حجم الانشطة الاقتصادية الداعمة. وتوفر المراكز التدريبية الخاصة وستة مراكز مهنية حيث اسهمت في توفير الايدي العاملة والمؤهلة في مختلف المجالات، مما عزز حركة النشاط الاقتصادي في المحافظة وفي مختلف القطاعات. وإن عدد السكان ونسبة الشباب في المجتمع الذي يسهم في وجود الايدي العاملة والمؤهلة والمتعلمة. والموقع الجغرافي يجعلها حلقة وصل ما بين سوريا وفلسطين مما يسهل حركة التنقلات البريه للبضائع والمسافرين للدول المجاورة. ووجود عدد من الطلاب الإجانب من جنسيات مختلفة وهذا بدوره حافز للمستثمريــن في مجال الفندقة والمدن السياحية والترفيهية والأبراج السكنية والمراكز التجارية و المطاعم."),
        "historicalTourism": MessageLookupByLibrary.simpleMessage(
            "تعود أصول مدينة إربد الى العصر البرونزي لعام 1222 ق.م، فقد عاصرت ُمختلف الحضارات اآلرمية والعمونية والرومانية اليونانية، لتكون بذلك من ال ُمستطونات القديمة جنوب بالد الشام. حيث خلَفت هذه الحضارات مختلف المناطق السياحية واألثرية فيها."),
        "historyIrbid": MessageLookupByLibrary.simpleMessage(
            "تُمثل إربد في ثنايها موروثاً حضارياً تعاقبت عليها الإمبراطوريات والأُمم السابقة، والتي خلّفت ورائها آثارها ومُقتنياتها وكنوزها التي ما زالت شامِخةً على أراضيها. ويوجد فيها مقامات الصحابةِ رضوان الله عليهم، والتي فتحت مجالاً للسياحة الدينية في زيارةٍ الى أضرحة هؤلاء الصحابة. منهم مقام سيدنا معاذ بن جبل في الشونة الشمالية، فهو من ابرز مقامات صحابة رسول الله في المنطقة لمكانة صاحبه عند رسول الله والذي وصفه صلى الله عليه وسلم بأعلم أُمته في الحلال والحرام وأوفده قاضياً لليمن لتعليمهم احكام الشريعة والقران الكريم، ثم توفي في طاعون. ويضم المقام مسجدا للرجال واخر للنساء ومكتبة والمركز الثقافي الاسلامي للرجال وحديقة ومواقف سيارات ومدرسة نموذجية للقران الكريم استحدثتها وزارة الاوقاف والمرافق الاخرى لزيادة الخدمات الدينية. وهناك الصحابي شرحبيل بن حسنة ومقامه في وادي الريان، وقد تمييز الصحابي بالشجاعة والتضحية والكرم والذكاء وحسن الادارة ما دفع بالخليفة عمر بن الخطاب رضي الله عنه الى توليته على ربع الشام، وشارك صاحب المقام رضي الله مع الرسول العظيم صلى الله عليه وسلم الهجرتين وفي معارك الشام. ثم توفي في طاعون عمواس في السنة الثامنة للهجرة. مقامُه يضم مصلى للرجال ومكتبة وحديقة ومواقف للسيارات وقبة ومأذنة. وهناك موقع معركة اليرموك بالقرب من نهر اليرموك والتي كانت سنة (15 هـ - 636م) بين المسلمين والإمبراطورية البيزنطية، يعتبرها بعض المؤرخين من أهم المعارك في تاريخ العالم لأنها كانت بداية أول موجة انتصارات للمسلمين خارج جزيرة العرب، وأدت لتقدم الإسلام السريع في بلاد الشام. المعركة حدثت بعد وفاة الرسول صلى الله عليه وسلم عام 632م بأربع سنوات."),
        "homePage": MessageLookupByLibrary.simpleMessage("الصحفة الرئيسية"),
        "introIrbid": MessageLookupByLibrary.simpleMessage(
            "أهلاً بكم في محافظة إربد عروس الشمال، حللتم سهلاً على أهلها الكِرام، أرض الفتوحات الإسلامية ومجمع الحضارات التاريخية، الآرامية والعمونية والرومانية واليونانية، فكانت تُسمى أرضُ فتحِ الشام. وأبرز معالمها نهر اليرموك المُسمّى تيمُناً بمعركة اليرموك الأبرز على أرض محافظة إربد. وقد سادت المسيحية كديانةٍ لسكانها وصولاً الى الإسلامية في وقتنا الحاضر. وتتكون من تقسيماتٍ إداريةٍ لكُلٍ منها قُراها ذات الـ 133 قرية. وبتعدادِ سُكان يصل الى 2 مليون نسمة مُتركزين في مُنتصفها بالمناطق السهلية المُنبسطة، بمُختلف ثقافاتهم الشعبية والمُمتزجة من شتى أنحاءها. وتعتبر المحافظة من أجمل المناخات في العالم حيث الوادي الأخضـر والذي يشكل مشتى متكامل وجبال دائمة الخُضرة على مدار العام، وسهول خصبة وتوفر الميـاه الجوفية، أي أنها ذات مُناخات امتنوعة، ما شكل حافزاً كبيراً للاستثمار بها في مجال السياحة. لنترككم الأن مع جولةٍ في معالمها بمُختلف قطاعاتها الحضارية."),
        "irbidCul":
            MessageLookupByLibrary.simpleMessage("الثقافة في مدينة إربد"),
        "irbidEco":
            MessageLookupByLibrary.simpleMessage("الإقتصاد في مدينة إربد"),
        "irbidEdu":
            MessageLookupByLibrary.simpleMessage("التعليم في مدينة إربد"),
        "irbidGovernorateHistory":
            MessageLookupByLibrary.simpleMessage("تاريخ مدينة إربد"),
        "irbidHeal":
            MessageLookupByLibrary.simpleMessage("القطاع الصحي في إربد"),
        "irbidHis": MessageLookupByLibrary.simpleMessage("تاريخ مدينة إربد"),
        "irbidTou": MessageLookupByLibrary.simpleMessage("السياحة في إربد"),
        "title": MessageLookupByLibrary.simpleMessage("إربد")
      };
}
