Repository: Debo15/Irbid-app
Catalog: lib/l10n/intl_*.arb
Languages: ar

# title
source: Irbid
ar: إربد

# dance
source: The north's pride
ar: عروس الشمال

source: Home page
ar: الصحفة الرئيسية

# irbidHis
source: Irbid history
ar: تاريخ مدينة إربد

# irbidCul
source: Culture in Irbid
ar: الثقافة في مدينة إربد

# irbidEco
source: Economy in Irbid
ar: الإقتصاد في مدينة إربد

# irbidEdu
source: Education in Irbid
ar: التعليم في مدينة إربد

# irbidTou
source: Tourism in Irbid
ar: السياحة في إربد

# irbidHeal
source: Health in Irbid
ar: القطاع الصحي في إربد

# aboutIrbidCity
source: About Irbid Governorate
ar: نبذة عن مدينة إربد

# introIrbid
source: Welcome to Irbid Governorate (Arous Al-shamal), the land of Islamic conquests and the complex of historical civilizations, Aramaic, Ammonite, Roman and Greek. Its most prominent landmark is the Yarmouk River, named after the most prominent Yarmouk battle on the land of Irbid Governorate. Christianity has prevailed as a religion for its inhabitants, down to Islam at the present time. It consists of administrative divisions, each with 133 villages. With a population of nearly 2 million people, concentrated in the middle of the flat plain areas, with their various popular and mixed cultures from all over its surrounding. The province is considered one of the most beautiful climates in the world, where the Green Valley which forms an integrated nursrey. Also, the mountains that are evergreen throughout the year. Moreover, the fertile plains and the availability of groundwater which constituted a great incentive to invest in it in the field of tourism.
ar: أهلاً بكم في محافظة إربد عروس الشمال، حللتم سهلاً على أهلها الكِرام، أرض الفتوحات الإسلامية ومجمع الحضارات التاريخية، الآرامية والعمونية والرومانية واليونانية، فكانت تُسمى أرضُ فتحِ الشام. وأبرز معالمها نهر اليرموك المُسمّى تيمُناً بمعركة اليرموك الأبرز على أرض محافظة إربد. وقد سادت المسيحية كديانةٍ لسكانها وصولاً الى الإسلامية في وقتنا الحاضر. وتتكون من تقسيماتٍ إداريةٍ لكُلٍ منها قُراها ذات الـ 133 قرية. وبتعدادِ سُكان يصل الى 2 مليون نسمة مُتركزين في مُنتصفها بالمناطق السهلية المُنبسطة، بمُختلف ثقافاتهم الشعبية والمُمتزجة من شتى أنحاءها. وتعتبر المحافظة من أجمل المناخات في العالم حيث الوادي الأخضـر والذي يشكل مشتى متكامل وجبال دائمة الخُضرة على مدار العام، وسهول خصبة وتوفر الميـاه الجوفية، أي أنها ذات مُناخات امتنوعة، ما شكل حافزاً كبيراً للاستثمار بها في مجال السياحة. لنترككم الأن مع جولةٍ في معالمها بمُختلف قطاعاتها الحضارية.
